#!/usr/bin/env python
# -*- coding:utf-8 -*-

'''
此文件为配置文件
需求涉及的博客地址为：https://blog.duoxuankeji.com/
'''

# 请求头
header = {
        "User-Agent": "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/74.0.3729.169 Safari/537.36"
    }

# 博客文章详情页网址
urlList = [
    # "https://blog.duoxuankeji.com/2019/05/30/%E9%93%B6%E8%81%9462%E8%8A%82-%E5%8D%8E%E5%A4%8F%E9%93%B6%E8%A1%8C%E9%93%B6%E8%A1%8C100%E5%80%8D%E7%A7%AF%E5%88%86%EF%BC%8C1%E4%B8%87%E5%88%86%E5%B0%81%E9%A1%B6/",
    # "https://blog.duoxuankeji.com/2019/05/30/%E9%93%B6%E8%81%9462%E8%8A%82-%E5%85%89%E5%A4%A7%E9%93%B6%E8%A1%8C100%E5%80%8D%E7%A7%AF%E5%88%865%E4%B8%87%E5%B0%81%E9%A1%B6%EF%BC%8C-6-2%E6%8A%98%E4%BC%98%E6%83%A0%E6%88%96%E6%BB%A1%E5%87%8F/",
    # "https://blog.duoxuankeji.com/2019/05/28/page_20190528010/",
    # "https://blog.duoxuankeji.com/2019/05/28/page_20190528009/",
    # "https://blog.duoxuankeji.com/2019/05/28/page_20190528008/",
    "https://blog.duoxuankeji.com/2019/05/28/page_20190528007/",
    "https://blog.duoxuankeji.com/2019/05/28/page_20190528006-2/",
    "https://blog.duoxuankeji.com/2019/05/28/page_20190528006/",
    "https://blog.duoxuankeji.com/2019/05/28/page_20190528004/",
    "https://blog.duoxuankeji.com/2019/05/28/page_20190528002/',  'https://blog.duoxuankeji.com/2019/05/28/page_20190528003/",
    "https://blog.duoxuankeji.com/2019/05/28/%E3%80%90%E4%BA%94%E6%9C%88%E7%BE%8A%E6%AF%9B%E6%B1%87%E6%80%BB%E3%80%91%E5%85%B4%E4%B8%9A%E9%93%B6%E8%A1%8C/",
    "https://blog.duoxuankeji.com/2019/05/27/%E7%9C%8B%E6%96%B0%E9%97%BB%E5%B0%B1%E8%83%BD%E8%B5%9A%E9%92%B1%EF%BC%9F/",
    "https://blog.duoxuankeji.com/2019/05/28/page_20180528005/",
    "https://blog.duoxuankeji.com/2019/05/24/%E5%8A%9E%E7%90%86%E4%BF%A1%E7%94%A8%E5%8D%A1%E6%9C%89%E4%BB%80%E4%B9%88%E5%A5%BD%E5%A4%84%EF%BC%9F/"
]

# 评论接口请求网址
comment_url = 'https://blog.duoxuankeji.com/wp-comments-post.php'

# 评论内容
commentList = [
    '撸起来，伙计们', '路过，顶一下', '回复标记学习一条龙', '先回复后学习', '支持楼主，感谢', '撸就完事了', '棒棒棒', '发现新羊毛了', '好好好', '辛苦啦！点个赞！', '谢谢……支持论坛。。感谢管理员。。',
    '谢谢分享', '手上没啥羊毛卡  撸不到羊毛呀', '坐下慢慢看', '玩毛搞起来', '薅薅薅薅薅薅薅薅薅', '薅薅薅薅薅', '薅薅薅', '感谢分享', '谢谢分享！', '好多羊毛，就是有些觉得很鸡肋', '给力总结',
    '水一个', '先顶！d=====(￣▽￣*)b再看', '收藏，准备看看', '支持一下，大赞楼主！', '顶起来', '顶顶！d=====(￣▽￣*)b', '顶顶顶', '顶顶顶顶', '顶顶顶顶顶', '顶顶顶顶顶顶', '不要怂，就是撸',
    '打卡支持活动', '我来打个卡~', '占位', '前来参加活动', '积极参加活动~嘻嘻', '马克，最近活动不断挺好的', '支持。。。', '支持支持活动', '我来参加活动了 哈哈', '这次优惠太少了', '感觉好麻烦  还是算了',
    '谢谢总结，活动太复杂了，薅毛不易啊。。。', '管理员辛苦了。。感谢', '后排呐喊助威~！', '管理辛苦了，感谢分享', '看一下', '学习了', '感觉很高兴，多撸毛', '赞一下', '感谢分享！不过真撸的时候有点费劲 ',
    '好多活动看花眼', '学习了，好文', '小伙子就是牛，撸它', '撸点积分算了', '优秀', '谢谢了，', '辛苦，缩水厉害。。。', '没有刚需，很多商家都没有，只能稍微撸点了', '感谢', '活动力度不是很大啊。。。',
    '这年头撸点东西难，感谢分享！', '有点乱 还是让了吧', '这次活动还算是给力了', '挺全的', '难度太大', '除了四大行都是野鸡行呀？', '感谢分享，我立刻就预定了', '昨晚用了，节约45元！大羊毛！！', '管理员辛苦了',
    '期待管理员分享更多的活动。。。', '支持支持.. ', '观.......', '很好。有需要的人去看·', '这心态可以，先看看撸不撸另说', '观望中....', '习惯性mark~', '支持支持耶耶耶', '插眼', '插眼  传送',
    '很喜欢这样的优惠活动合集。赞', '好的', '感谢整理，分享。', '大家来说说', '家里蹲啥都没撸', '挺不错的，都是刚需', '稳稳的，老农领到券了就没问题', '可以，有效期还挺长', '今天也是悠闲的一天，撸毛顺容易上火',
    '没撸。', '可以的老铁', '有活动有刚需可以考虑下', '薅羊毛报国', '大佬收货满满呀', '三户撸了一天线上加线下好几百羊毛，累死我了！', '这个吃到爽', '再撸要累吐血了！每年618，双11，不敢想了，看来专业撸羊毛也不比上班轻松呀！',
    '撸完也算小有收获', '不撸了  没啥意思，还是老老实实的搂着媳妇睡觉吧  安安心心过周末', '哈哈，我说这个毛，要琢磨哦', '感谢版主 进去撸上了', '感谢管理员小表弟。。', '嘻嘻，谢谢楼主', '谢谢楼主，已撸'
]

# 第一条评论
first_commentList = [
    '前排', '第一名', '沙发', '前排留言', '第一第一，永远第一', '必须支持-----好激动第一次坐这么近的距离', '沙发坐坐'
]

# 评论姓名、邮箱
authorEmailList = [
    ['菊花一紧', '19762785947@qq.com'], ['王二', 'jack@163.com'], ['Carl', 'carl111@163.com'], ['Yzq', 'yzq888@163.com'], ['白天不懂夜的黑', '489762984@qq.com'], ['阿怡嘿', '5793697@163.com'],
    ['浪里白条★氼★疙瘩囡', 'jack@163.com'], ['kashen87685728', 'jack@163.com'], ['繁华似锦8999', 'jack@163.com'], ['tjmcs', 'jack@163.com'], ['许沵1世繁华', '2333@163.com'], ['PRICELESS', '2333@163.com'],
    ['qqws66588', '2333@163.com'], ['浩恩', '2333@163.com'], ['简园壶翁', '2333@163.com'], ['白前辈222222', '2333@163.com'], ['Hello马先生', '2333@163.com'], ['上下衣申', '2333@163.com'],
    ['水土不服就服你！', '2333@163.com'], ['爱浪的人不浪漫', '2333@163.com'], ['MrServer', '2333@163.com'], ['pan0111', '2333@163.com'], ['zhangy0205', '2333@163.com'], ['后天男孩', '2333@163.com'],
    ['moonshine', '2333@163.com'], ['谜语大全谜语', '2333@163.com'], ['人文明', '2333@163.com'], ['我愛錢', '2333@163.com'], ['ghj910622', '2333@163.com'], ['新仁上斑打牌', '2333@163.com'], ['惠民', '2333@163.com'],
    ['机绣华', '2333@163.com'], ['燃烧卡路里', '2333@163.com'], ['宫羽鹤', '2333@163.com'], ['偷乳师111', '2333@163.com'], ['响亮的名号555', '2333@163.com'], ['每天溜达一圈', '2333@163.com'],
    ['雨淅沥沥的下', '2333@163.com'], ['小轩子', '2333@163.com'], ['撸出神', '2333@163.com'], ['Mr烂先生', '2333@163.com'], ['shicaoshuai', '2333@163.com'], ['Jordan', '2333@163.com'], ['恼火皮皮虾', '2333@163.com'],
    ['栗子橙子', '2333@163.com'], ['红牛老号', '2333@163.com'], ['mark96', '2333@163.com'],['zihan888', '2333@163.com'], ['逆势前进', '2333@163.com'], ['聽丶説', '2333@163.com'], ['夜丶sir', '2333@163.com'],
    ['轻狂人生', '2333@163.com'], ['px5900', '2333@163.com'], ['COC我最棒', '2333@163.com'], ['丁丁', '2333@163.com'], ['栗子', '2333@163.com'], ['橙子', '2333@163.com'], ['xxnvc', '2333@163.com'],
    ['羊毛撸多少有多', '2333@163.com'], ['米兰剑客', '2333@163.com'], ['就是一位普通人', '2333@163.com'], ['秋风016', '2333@163.com'], ['逍遥子', ''], ['小白玩信用卡', '2333@163.com'], ['撸人杰', '2333@163.com'],
    ['zjhaze', '2333@163.com'], ['蓝梦紫缕', '2333@163.com'], ['已注销该用户', '2333@163.com'], ['该用户已成仙', '2333@163.com'], ['無嘻要有坚持', '2333@163.com'], ['多多传说', '2333@163.com'], ['lingxinyuren', '2333@163.com'],
    ['ATET', '2333@163.com'], ['ATM1号', '2333@163.com'], ['唯我独尊', '2333@163.com'], ['八荒六合我第一', '2333@163.com'], ['宇宙第一撸少女', '2333@163.com'], ['宇宙第一美少女', '2333@163.com'],
    ['宇宙第一美少女的男朋友', '2333@163.com'], ['眼见她翩翩起舞', '2333@163.com'], ['城市猎人007', '2333@163.com'], ['走位走位轨道看不见', '2333@163.com'], ['有梦想就努力实现233', '2333@163.com'], ['柏太郎', '2333@163.com'],
    ['依然是路过圆圆', '2333@163.com'], ['白鸡朝凤', '2333@163.com'], ['依然法克油', '2333@163.com'], ['amazonn__520', '2333@163.com'], ['是蛋蛋呀', '2333@163.com'], ['撸兵葛二蛋', '2333@163.com'], ['qiu030108', '2333@163.com'],
    ['鸡毛是我家狗', '2333@163.com'], ['luanwudejuhua', '2333@163.com'], ['南京李志005', '2333@163.com'], ['优可优客yoki', '2333@163.com'], ['早日脱坑', '2333@163.com'], ['沧海啄鱼', ''], ['上上上上周', '2333@163.com'],
    ['lmzm88', '2333@163.com'], ['时间啊哦额', '2333@163.com'], ['劲仔呀', '2333@163.com'], ['周星星的月光宝盒', '2333@163.com'], ['代表你消灭月亮23333', '2333@163.com'], ['eeta', '2333@163.com'],['星空下2019', '2333@163.com'],
    ['潇香雪海', '2333@163.com'], ['收废品咯', '2333@163.com'], ['小轩子', '2333@163.com'], ['来是come去是go', '2333@163.com'], ['撸毛大神', '2333@163.com'], ['千山鸟飞绝', '2333@163.com'], ['小白薅羊毛', '2333@163.com'],
    ['超喜欢养猫来撸', '2333@163.com'], ['Nxvboy', '2333@163.com'], ['后生门', '2333@163.com'], ['小仓老师', '2333@163.com'], ['鲁小杰', '2333@163.com'], ['农村你黑哥', ''], ['jineterenegado', '2333@163.com'],
    ['ChickenMan', '2333@163.com'], ['m咔咔m', '2333@163.com'], ['半生不成熟', '2333@163.com'], ['孤雪红梅', '2333@163.com'], ['什么冬梅', '2333@163.com'], ['sbkangshuo', '2333@163.com'], ['LRC661', '2333@163.com'],
    ['白龙马表弟', '2333@163.com'], ['二龙湖浩哥', '2333@163.com'], ['人在江湖飘啊飘888', '2333@163.com'], ['Aaron998', '2333@163.com'], ['faouh', '2333@163.com']
]

# 评论接口发送请求时的其他参数
submit = '发表评论'
comment_parent = 0